app/controllers/posts_controller.rb

  def show
    if !params[:id]
      @post = Post.find_by_title('Welcome')
    elsif params[:id] =~ /^[a-zA-Z ]+$/
      @post = Post.find_by_title(params[:id])
    else
      @post = Post.find(params[:id].to_i)
---
SELECT "posts".* FROM "posts" WHERE "posts"."title" = 'Welcome' LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 16]]